In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'ID' : [1,2,3],
                    'Nombre' : ['Juan', 'Maria', 'Pedro']})

df2 = pd.DataFrame({'ID' : [1,2,4],
                    'Edad' : [25, 30, 35]})

In [5]:
df1

   ID Nombre
0   1   Juan
1   2  Maria
2   3  Pedro

In [4]:
df2

   ID  Edad
0   1    25
1   2    30
2   4    35

In [6]:
df_combinado = pd.merge(df1, df2, on='ID')
df_combinado

   ID Nombre  Edad
0   1   Juan    25
1   2  Maria    30

In [8]:
libros = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'titulo': ['El Quijote', 'La Odisea', 'Cien Años de Soledad', 'El Principito']
})

autores = pd.DataFrame({
    'ID': [1, 2, 3, 5],
    'nombre': ['Miguel de Cervantes', 'Homero', 'Gabriel García Márquez', 'J.K. Rowling']
})

libros_autores = pd.merge(libros, autores, on= 'ID')
libros_autores

   ID                titulo                  nombre
0   1            El Quijote     Miguel de Cervantes
1   2             La Odisea                  Homero
2   3  Cien Años de Soledad  Gabriel García Márquez